# PDF_GetPageCount

## Description
Returns the page count of the selected document file.

```pascal
FUNCTION PDF_GetPageCount(inFilePath : PROCEDURE): INTEGER;
```

```python
def vs.PDF_GetPageCount(inFilePath):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inFilePath|PROCEDURE|   |

## Version
Availability: from Vectorworks 2014

## Category
* PDF